Автосервис/src/Documents/ЗаказНаряд/ЗаказНаряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаряд</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.ВладельцыАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.АвтомобилиКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаказНаряда</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОбращения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Калькуляция</name>
    <type>
      <types>DocumentRef.Калькуляция</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаЧас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МастерПриемщик</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Автодетали</name>
    <attributes>
      <name>Автодеталь</name>
      <type>
        <types>CatalogRef.Автодетали</types>
      </type>
    </attributes>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДетальКлиента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Автосервис/src/InformationRegisters/СтоимостьМатериалов/СтоимостьМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьМатериалов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автосервис/src/Enums/СтатусЗаказНаряда/СтатусЗаказНаряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаказНаряда</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ЗавершеныРаботы</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОплаты</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Автосервис/src/Documents/Калькуляция/Калькуляция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Калькуляция</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.ВладельцыАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.АвтомобилиКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОбращения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаЧас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Автодетали</name>
    <attributes>
      <name>Автодеталь</name>
      <type>
        <types>CatalogRef.Автодетали</types>
      </type>
    </attributes>
    <attributes>
      <name>Материал1</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Материал2</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Материал3</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаРаботу</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Автосервис/src/Documents/ЗаказНаряд/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем дату документа на текущую дату
	Объект.Дата = ТекущаяДата();
	
	// Устанавливаем статус по умолчанию - "Приемка"
	Если Объект.Статус = Неопределено Или Объект.Статус.Пустая() Тогда
		Объект.Статус = Перечисления.СтатусЗаказНаряда.Приемка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	
	// 
	Если Объект.Клиент = Неопределено Или Объект.Клиент.Пустая() Тогда
		Сообщить("Необходимо указать клиента!");
		Возврат;
	КонецЕсли;
	
	Если Объект.Автомобиль = Неопределено Или Объект.Автомобиль.Пустая() Тогда
		Сообщить("Необходимо указать автомобиль!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНаСервере()
	
	// ываываываыва
	// 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Калькуляция.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|ГДЕ
	|	Калькуляция.Клиент = &Клиент
	|	И Калькуляция.Автомобиль = &Автомобиль
	|	И Калькуляция.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Калькуляция.Дата УБЫВ
	|	, Калькуляция.МоментВремени УБЫВ";
	
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
	Запрос.УстановитьПараметр("Автомобиль", Объект.Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		// 
		Объект.Калькуляция = Выборка.Ссылка;
		ЗаполнитьИзКалькуляцииНаСервере();
	Иначе
		// 
		Сообщить("Калькуляция для данного клиента и автомобиля не найдена. Заполните данные вручную или создайте калькуляцию.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	// 
	//
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	// 
	Если Объект.Статус = Неопределено Или Объект.Статус.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	//
	// 
	
КонецПроцедуры

&НаКлиенте
Процедура КалькуляцияПриИзменении(Элемент)
	
	// 
	Если Объект.Калькуляция <> Неопределено И Не Объект.Калькуляция.Пустая() Тогда
		ЗаполнитьИзКалькуляцииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзКалькуляцииНаСервере()
	
	// 
	Если Объект.Калькуляция = Неопределено Или Объект.Калькуляция.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументКалькуляция = Объект.Калькуляция.ПолучитьОбъект();
	
	//
	Объект.Работы.Очистить();
	Для Каждого СтрокаРаботы Из ДокументКалькуляция.Работы Цикл
		НоваяСтрокаРаботы = Объект.Работы.Добавить();
		НоваяСтрокаРаботы.Работа = СтрокаРаботы.Работа;
		НоваяСтрокаРаботы.Количество = СтрокаРаботы.Количество;
		НоваяСтрокаРаботы.НормаЧас = СтрокаРаботы.НормаЧас;
		НоваяСтрокаРаботы.Сумма = СтрокаРаботы.НормаЧас * СтрокаРаботы.Количество;
	КонецЦикла;
	
	// 
	Объект.Автодетали.Очистить();
	Для Каждого СтрокаДетали Из ДокументКалькуляция.Автодетали Цикл
		НоваяСтрокаДетали = Объект.Автодетали.Добавить();
		НоваяСтрокаДетали.Автодеталь = СтрокаДетали.Автодеталь;
		НоваяСтрокаДетали.Количество = СтрокаДетали.Количество;
		// 
		НоваяСтрокаДетали.ДетальКлиента = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
	
	// 
	СтрокаРаботы = Элементы.Работы.ТекущиеДанные;
	Если СтрокаРаботы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаРаботы.Работа <> Неопределено И Не СтрокаРаботы.Работа.Пустая() Тогда
		// 
		НормаЧас = ПолучитьНормаЧасРаботыНаСервере(СтрокаРаботы.Работа);
		Если НормаЧас > 0 Тогда
			СтрокаРаботы.НормаЧас = НормаЧас;
			// 
			ПересчитатьСуммуРаботы(СтрокаРаботы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНормаЧасРаботы(Работа)
	
	Если Работа = Неопределено Или Работа.Пустая() Тогда
		Возврат 0;
	КонецЕсли;
	
	Попытка
		РаботаОбъект = Работа.ПолучитьОбъект();
		Если РаботаОбъект.Свойство("НормаЧас") Тогда
			Возврат РаботаОбъект.НормаЧас;
		Иначе
			Возврат 0;
		КонецЕсли;
	Исключение
		Возврат 0;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция ПолучитьНормаЧасРаботыНаСервере(Работа)
	
	Возврат ПолучитьНормаЧасРаботы(Работа);
	
КонецФункции

&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	
	// 
	СтрокаРаботы = Элементы.Работы.ТекущиеДанные;
	Если СтрокаРаботы <> Неопределено Тогда
		ПересчитатьСуммуРаботы(СтрокаРаботы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РассчитатьНормаЧасы(Работа, Количество)
	РаботаОбъект = Работа.ПолучитьОбъект();
	Возврат РаботаОбъект.НормаЧас * Количество
КонецФункции

&НаКлиенте
Процедура ПересчитатьСуммуРаботы(СтрокаРаботы)
	
	Если СтрокаРаботы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// 
	СтрокаРаботы.Сумма = СтрокаРаботы.НормаЧас * СтрокаРаботы.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтодеталиАвтодетальПриИзменении(Элемент)
	
	// 
	
КонецПроцедуры

&НаКлиенте
Процедура АвтодеталиДетальКлиентаПриИзменении(Элемент)
	
	// 
	СтрокаДетали = Элементы.Автодетали.ТекущиеДанные;
	Если СтрокаДетали = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДетали.ДетальКлиента Тогда
		//
		СтрокаДетали.Автодеталь = Неопределено;
		СтрокаДетали.Материал = Неопределено;
		СтрокаДетали.Цена = 0;
		СтрокаДетали.Сумма = 0;
	Иначе
		// 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтодеталиМатериалПриИзменении(Элемент)
	
	// 
	СтрокаДетали = Элементы.Автодетали.ТекущиеДанные;
	Если СтрокаДетали = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// 
	Если СтрокаДетали.ДетальКлиента Тогда
		СтрокаДетали.Цена = 0;
		СтрокаДетали.Сумма = 0;
		Возврат;
	КонецЕсли;
	
	Если СтрокаДетали.Материал <> Неопределено И Не СтрокаДетали.Материал.Пустая() Тогда
		// 
		Цена = ПолучитьЦенуМатериалаНаСервере(СтрокаДетали.Материал);
		Если Цена > 0 Тогда
			СтрокаДетали.Цена = Цена;
			ПересчитатьСуммуДетали(СтрокаДетали);
		Иначе
			СтрокаДетали.Цена = 0;
			СтрокаДетали.Сумма = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуМатериала(Материал)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтоимостьМатериалов.Материал,
	|	СтоимостьМатериалов.Стоимость
	|ИЗ
	|	РегистрСведений.СтоимостьМатериалов КАК СтоимостьМатериалов
	|ГДЕ
    |   СтоимостьМатериалов.Материал = &Материал";
    Запрос.УстановитьПараметр(
        "Материал", Материал    
    );
    РезультатЗапроса = Запрос.Выполнить();
    Записи = РезультатЗапроса.Выбрать();
    Пока Записи.Следующий() Цикл
        Возврат Записи.Стоимость;
    КонецЦикла;
КонецФункции

&НаКлиенте
Функция ПолучитьЦенуМатериалаНаСервере(Материал)
	
	Возврат ПолучитьЦенуМатериала(Материал);
	
КонецФункции

&НаКлиенте
Процедура АвтодеталиКоличествоПриИзменении(Элемент)
	
	// 
	СтрокаДетали = Элементы.Автодетали.ТекущиеДанные;
	Если СтрокаДетали <> Неопределено Тогда
		// 
		Если СтрокаДетали.ДетальКлиента Тогда
			СтрокаДетали.Сумма = 0;
		Иначе
			ПересчитатьСуммуДетали(СтрокаДетали);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтодеталиЦенаПриИзменении(Элемент)
	
	// 
	СтрокаДетали = Элементы.Автодетали.ТекущиеДанные;
	Если СтрокаДетали <> Неопределено Тогда
		//
		Если СтрокаДетали.ДетальКлиента Тогда
			СтрокаДетали.Сумма = 0;
		Иначе
			ПересчитатьСуммуДетали(СтрокаДетали);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуДетали(СтрокаДетали)
	
	Если СтрокаДетали = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//
	Если СтрокаДетали.ДетальКлиента Тогда
		СтрокаДетали.Сумма = 0;
		Возврат;
	КонецЕсли;
	
	// 
	СтрокаДетали.Сумма = СтрокаДетали.Цена * СтрокаДетали.Количество;
	
КонецПроцедуры
